Revit 2025 API
StructuralType Enumeration
 Represents the structural type of a family instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StructuralType
Public Enumeration StructuralType
public enum class StructuralType
type StructuralType
Members
Member name | Value | Description
NonStructural | 0 |  Non-Structural
Beam | 1 |  Structural Beam
Brace | 2 |  Structural Brace
Column | 3 |  Structural Column
Footing | 4 |  Structural Footing
UnknownFraming | 5 |  Unknown Framing
See Also
Reference
Autodesk.Revit.DB.Structure Namespace